In [1]:
# Import libraries
import pandas as pd
import numpy as np
import datetime

from sklearn import linear_model

In [2]:
# Import dataset
df = pd.read_csv('hiring.csv')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [4]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [7]:
df.experience = df.experience.fillna("zero")

In [8]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [9]:
from word2number import w2n

In [12]:
df.experience = df.experience.apply(w2n.word_to_num)

In [14]:
import math

In [16]:
median_test_score = math.floor(df['test_score(out of 10)'].mean())

In [18]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_test_score)

In [21]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [22]:
from sklearn import linear_model

In [23]:
reg = linear_model.LinearRegression()

In [25]:
X = df[['experience','test_score(out of 10)','interview_score(out of 10)']]
y = df['salary($)']

In [28]:
reg.fit(X, y)

LinearRegression()

In [30]:
reg.predict([
    [2,9,6],
    [12,10,10]
])

array([53713.86677124, 93747.79628651])

In [33]:
reg.intercept_

14992.65144669314

In [34]:
reg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])